Repository: papaphua/messenger-app
Catalog: src/MessengerApp.Application/Resources/Results.*.resx
Languages: uk

# ChatCreateError
source: Could not create chat.
uk: Не вдалося створити чат.

source: Invalid link.
uk: Невірне посилання.

source: User not found.
uk: Користувач не знайдений.

source: Profile updated.
uk: Профіль оновлено.

# ProfilePictureUpdate
source: Profile picture updated.
uk: Фото профілю оновлено.

# PasswordChanged
source: User password changed.
uk: Пароль користувача змінено.

# EmailAlreadyConfirmed
source: Email address already confirmed.
uk: Пошта вже підтвержена.

# EmailConfirmed
source: Email address confirmed.
uk: Пошту підтверджено.

# EmailChanged
source: Email address changed.
uk: Пошту змінено.

# EmailSameAsCurrent
source: Email address must be different from current.
uk: Нова пошта повинна відрізнятися від поточної.

# EmailChangeError
source: Could not change email, try again.
uk: Невдалося змінити пошту, спробуйте ще раз.

# ExternalUserPasswordError
source: Users authenticated using third party services can not change their password.
uk: Користувачі авторизовані за допомогою сторонніх сервісів не можуть змінювати свій пароль.

# ExternalUserEmailError
source: Users authenticated using third party services can not change their email address.
uk: Користувачі авторизовані за допомогою сторонніх сервісів не можуть змінювати свою пошту.

# MessageSendError
source: Could not send message.
uk: Не вдалося відправити повідомлення.

source: Chat not found.
uk: Чат не знайдено.

source: Chats empty.
uk: Чати порожні.

# ChatRemoveError
source: Could not remove chat.
uk: Не вдалося видалити чат.

# ChatLeaveError
source: Could not leave chat.
uk: Не вдалося залишити чат.

# ChatJoinError
source: Could not join chat.
uk: Не вдалося приєднатися до чату

# ChatAlreadyMember
source: Already member.
uk: Ви вже член цього чату.

# AlreadyReacted
source: Message is already reacted.
uk: Ви вже відреагували на це повідомлення.

# ReactionsNotAllowed
source: Reactions are disabled in this chat.
uk: Реакції вимкнені в цьому чаті.

# CommentsNotAllowed
source: Comments are disabled in this chat.
uk: Коментарі вимкнені в цьому чаті.

# EmailAlreadyTaken
source: Email address {0} already used.
uk: Пошта {0} вже зареєстровна.

# EmailChangeRequestSentTo
source: Email change confirmation sent to {email}.
uk: Повідомлення для підтвердження зміни пошти відправлено на адресу {0}.

# EmailConfirmationRequestSentTo
source: Email confirmation link sent to {0}.
uk: Повідомлення для підтвердження пошти відправлено на адресу {0}.

# NoSearchResultsFor
source: No search results for {0}.
uk: Не вдалося нічого знайи для запиту {0}.
